app/controllers/admin/categories_controller.rb

  def index
    if params[:id].blank?
      @categories = Category.roots
    else
      @category = Category.find(params[:id])
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 10 LIMIT 1

  def create
    @category = Category.new(params.require(:category).permit!)

    if @category.save
---
INSERT INTO `categories` (`title`, `weight`, `created_at`, `updated_at`, `ancestry`) VALUES ('a1', 100, '2017-03-01 02:06:10', '2017-03-01 02:06:10', '4')

  def update
    @category.attributes = params.require(:category).permit!

    if @category.save
---
UPDATE `categories` SET `title` = 'a2', `weight` = 11, `updated_at` = '2017-03-01 02:31:41' WHERE `categories`.`id` = 4

  def destroy
    if @category.destroy
---
DELETE FROM `categories` WHERE `categories`.`id` = 5

  def find_category
    @category = Category.find(params[:id])
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 4 LIMIT 1