app/controllers/admin/product_images_controller.rb

INSERT INTO `product_images` (`product_id`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `created_at`, `updated_at`) VALUES (4, '20170303103944904.png', 'image/png', 118012, '2017-03-03 03:08:14', '2017-03-03 03:08:14', '2017-03-03 03:08:14')
---
  def create
    params[:images].each do |image|
      @product.product_images << ProductImage.new(image: image)

SELECT  `product_images`.* FROM `product_images` WHERE `product_images`.`product_id` = 4 AND `product_images`.`id` = 1 LIMIT 1
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 4 LIMIT 1
DELETE FROM `product_images` WHERE `product_images`.`id` = 1
---
  def destroy
    @product_image = @product.product_images.find(params[:id])
    if @product_image.destroy

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 4 LIMIT 1
UPDATE `product_images` SET `weight` = 3, `updated_at` = '2017-03-03 03:44:18' WHERE `product_images`.`id` = 3
---
  def update
    @product_image = @product.product_images.find(params[:id])
    @product_image.weight = params["weight"]
    if @product_image.save

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 4 LIMIT 1
---
  def find_product
    @product = Product.find params[:product_id]