app/controllers/admin/products_controller.rb

SELECT  `products`.* FROM `products` ORDER BY `products`.`id` DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `products`
---
  def index
    @products = Product.page(params[:page] || 1).per_page(params[:per_page] || 10)
      .order(id: "desc")

INSERT INTO `products` (`category_id`, `title`, `amount`, `uuid`, `msrp`, `price`, `description`, `created_at`, `updated_at`) VALUES (16, 'killzone', 100, '0302SY56BO', 32.99, 29.99, 'col.....', '2017-03-02 07:38:47', '2017-03-02 07:38:47')
---
  def create
    @product = Product.new(params.require(:product).permit!)
    @root_categories = Category.roots

    if @product.save