app/controllers/categories_controller.rb

  def show
    fetch_home_data
    @category = Category.find(params[:id])
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 16 LIMIT 1