app/controllers/shopping_carts_controller.rb

  def index
    fetch_home_data
    @shopping_carts = ShoppingCart.by_user_uuid(session[:user_uuid])
      .order("id desc").includes([:product => [:mian_product_image]])
---
SELECT `shopping_carts`.* FROM `shopping_carts` WHERE `shopping_carts`.`user_uuid` IS NULL ORDER BY id desc

  def find_shopping_cart
    @shopping_cart = ShoppingCart.by_user_uuid(session[:user_uuid])
      .where(id: params[:id]).first
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1