app/controllers/users_controller.rb

  def create
    @user = User.new(params.require(:user)
      .permit(:email, :password, :password_confirmation))
    @user.uuid = session[:user_uuid]

    if @user.save
---
INSERT INTO `users` (`email`, `crypted_password`, `salt`, `created_at`, `updated_at`, `activation_state`, `activation_token`) VALUES ('111@qq.com', '$2a$10$W5s3A3blbN8qsb..H5JbzuMl902e/nhqckU7V3eaT5dkJPNU9Zzta', 'x3rGqFoo_iaZWGNmtpCR', '2017-02-27 08:47:40', '2017-02-27 08:47:40', 'pending', 'woomzgvJ5G1QbcAMxbGp')